In [1]:
'''Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
Solution:
'''
import pandas as pd
l = [4,8,15,16,23,42]
s = pd.Series(l)
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
Solution:
'''
l = [1,23,43,5,5,6,7,6,43,3]
s = pd.Series(l)
s

0     1
1    23
2    43
3     5
4     5
5     6
6     7
7     6
8    43
9     3
dtype: int64

In [3]:
'''Q3. Create a Pandas DataFrame that contains the following data:
Solution:
'''
l = [ { 'Name': 'Alice','Age':25,'Gender': 'Female'},
     { 'Name': 'Bob','Age':30,'Gender': 'Male'},
     { 'Name': 'Clarie','Age':27,'Gender': 'Female'}]
df = pd.DataFrame(l)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [4]:
'''Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Solution:
In Pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different data types. It is similar to a table in a relational database or a spreadsheet. 
On the other hand, a Series is a one-dimensional labeled array that can contain data of any type. It can be thought of as a single column of a DataFrame or a key-value pair of a dictionary.
'''
#Series
s = pd.Series([10, 20, 30, 40, 50])
print(s)

#DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 32, 18],
        'Gender': ['female', 'male', 'male']}
df = pd.DataFrame(data)
df

0    10
1    20
2    30
3    40
4    50
dtype: int64

      Name  Age  Gender
0    Alice   25  female
1      Bob   32    male
2  Charlie   18    male

In [5]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
Solution:
df.head(): This function is used to display the first n rows of a DataFrame. It is useful for quickly examining the data and making sure it has been read in correctly.

df.tail(): This function is used to display the last n rows of a DataFrame. It is useful for quickly examining the data and making sure it has been read in correctly.

df.info(): This function is used to display information about the DataFrame, such as the data types of each column, the number of non-null values, and the memory usage. It is useful for getting a quick summary of the DataFrame.

df.describe(): This function is used to display summary statistics for the DataFrame, such as the mean, standard deviation, and quartiles of each column. It is useful for getting a quick sense of the distribution of the data.

df.dropna(): This function is used to remove rows with missing values from the DataFrame. It is useful for cleaning the data and preparing it for analysis.

df.groupby(): This function is used to group the data in the DataFrame by one or more columns, and then apply a function to each group. It is useful for aggregating the data and computing summary statistics for each group.

df.merge(): This function is used to combine two DataFrames based on a common column. It is useful for combining data from different sources into a single DataFrame.
'''
data = {'date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-01', '2022-01-02', '2022-01-03'],
        'item': ['apple', 'banana', 'orange', 'banana', 'apple', 'banana'],
        'quantity': [2, 3, 4, 1, 2, 2],
        'price': [1.0, 0.5, 0.75, 0.5, 1.0, 0.5]}
df = pd.DataFrame(data)
data = df.groupby('item')['quantity','price'].sum()
data

/tmp/ipykernel_2862/576739210.py:22: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data = df.groupby('item')['quantity','price'].sum()

        quantity  price
item
apple          4   2.00
banana         6   1.50
orange         4   0.75

In [6]:
'''Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Solution:
The Series and DataFrame objects are mutable in nature, meaning that the values in these objects can be changed or modified after they are created. 
'''

'Q6. Which of the following is mutable in nature Series, DataFrame, Panel?\nSolution:\nThe Series and DataFrame objects are mutable in nature, meaning that the values in these objects can be changed or modified after they are created. \n'

In [7]:
'''Q7. Create a DataFrame using multiple Series. Explain with an example.
Solution:
'''
Name = ['Alice','Bob','Chris']
Age = [23,32,21]
Gender = ['Female','Male','Female']
data = {'Name' :Name,'Age':Age,'Gender':Gender}
df = pd.DataFrame(data)
df

    Name  Age  Gender
0  Alice   23  Female
1    Bob   32    Male
2  Chris   21  Female